#include <stdio.h>
#include <windows.h>

int ten(char *pbin, int n);

int main(void)
{
    char pbin[8] = "00011001";
    int num;

    num = ten(pbin, 8);
    printf("The number is %d\n", num);

    system("pause");
    return 0;
}

int ten(char *pbin, int n)
{
    int num = 0;
    int i;

    for (i = 0; i < n; i++)             //将二进制字符串转为十进制数，可手动推一遍就懂了    
    {
        num <<= 1;                                           
        num |= (pbin[i] - '0');         
    }

    return num;
}

/*
i=0：n:      00000000<<1 -> 00000000         00000000 | 0 -> 00000000
i=1：n:      00000000<<1 -> 00000000         00000000 | 0 -> 00000000
i=2：n:      00000000<<1 -> 00000000         00000000 | 0 -> 00000000
i=3：n:      00000000<<1 -> 00000000         00000000 | 1 -> 00000001
i=4：n:      00000001<<1 -> 00000010         00000010 | 1 -> 00000011 
i=5：n:      00000011<<1 -> 00000110         00000110 | 0 -> 00000110    
i=6：n:      00000110<<1 -> 00001100         00001100 | 0 -> 00001100 
i=7：n:      00001100<<1 -> 00011000         00011000 | 1 -> 00011001 
*/